hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_84_3.h
/*
 * I2S Driver
 *
 *
 */

#pragma once

#pragma message "NOTE: ESP32 support using I2S parallel driver. All strips must use the same chipset"

FASTLED_NAMESPACE_BEGIN

#ifdef __cplusplus
extern "C" {
#endif

#include "esp_heap_caps.h"
#include "soc/soc.h"
#include "soc/gpio_sig_map.h"
#include "soc/i2s_reg.h"
#include "soc/i2s_struct.h"
#include "soc/io_mux_reg.h"
#include "driver/gpio.h"
#include "driver/periph_ctrl.h"
#include "rom/lldesc.h"
#include "esp_intr.h"
#include "esp_log.h"
#include <soc/rtc.h>


#ifdef __cplusplus
}
#endif

__attribute__ ((always_inline)) inline static uint32_t __clock_cycles() {
    uint32_t cyc;
    __asm__ __volatile__ ("rsr %0,ccount":"=a" (cyc));
    return cyc;
}


#define NUM_COLOR_CHANNELS 3

// -- Choose which I2S device to use
#ifndef I2S_DEVICE
#define I2S_DEVICE 0
#endif


// -- Max number of controllers we can support
#ifndef FASTLED_I2S_MAX_CONTROLLERS
#define FASTLED_I2S_MAX_CONTROLLERS 24
#endif

// -- I2S clock
#define I2S_BASE_CLK (80000000L)
#define I2S_MAX_CLK (20000000L) //more tha a certain speed and the I2s looses some bits
#define I2S_MAX_PULSE_PER_BIT 20 //put it higher to get more accuracy but it could decrease the refresh rate without real improvement
// -- Convert ESP32 cycles back into nanoseconds
#define ESPCLKS_TO_NS(_CLKS) (((long)(_CLKS) * 1000L) / F_CPU_MHZ)
#define NUM_VIRT_PINS 7
#ifndef NBIS2SERIALPINS
#define NBIS2SERIALPINS 1
#endif
#ifndef NUM_LEDS_PER_STRIP
#define NUM_LEDS_PER_STRIP 256
#endif
#define OFFSET NUM_VIRT_PINS + 1
#define I2S_OFF (NUM_VIRT_PINS + 1 )* NUM_LEDS_PER_STRIP
#define I2S_OFF2 I2S_OFF * NBIS2SERIALPINS - NUM_LEDS_PER_STRIP
#define I2S_OFF3 I2S_OFF * NBIS2SERIALPINS + NUM_LEDS_PER_STRIP
#define I2S_OFF4 I2S_OFF * NBIS2SERIALPINS -  3 * NUM_LEDS_PER_STRIP
#define AA (0x00AA00AAL)
#define CC (0x0000CCCCL)
#define FF (0xF0F0F0F0L)
#define FF2 (0x0F0F0F0FL)




#ifdef STATIC_COLOR_PER_PIN
    #ifdef COLOR_1_RGB
       #define C1_R 0
       #define C1_G 1
       #define C1_B 2
    #else
	    #ifdef COLOR_1_RBG
		   #define C1_R 0
		   #define C1_G 2
		   #define C1_B 1
	    #else
		   #ifdef COLOR_1_GBR
			   #define C1_R 2
			   #define C1_G 0
			   #define C1_B 1
		   #else
		   	   #ifdef COLOR_1_BGR
				   #define C1_R 2
				   #define C1_G 1
				   #define C1_B 0
			   #else
					#ifdef COLOR_1_BRG
					   #define C1_R 1
					   #define C1_G 2
					   #define C1_B 0
				   #else
					  #define C1_G 0
					  #define C1_R 1
					  #define C1_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_2_RGB
       #define C2_R 0
       #define C2_G 1
       #define C2_B 2
    #else
	    #ifdef COLOR_2_RBG
		   #define C2_R 0
		   #define C2_G 2
		   #define C2_B 1
	    #else
		   #ifdef COLOR_2_GBR
			   #define C2_R 2
			   #define C2_G 0
			   #define C2_B 1
		   #else
		   	   #ifdef COLOR_2_BGR
				   #define C2_R 2
				   #define C2_G 1
				   #define C2_B 0
			   #else
					#ifdef COLOR_2_BRG
					   #define C2_R 1
					   #define C2_G 2
					   #define C2_B 0
				   #else
					  #define C2_G 0
					  #define C2_R 1
					  #define C2_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_3_RGB
       #define C3_R 0
       #define C3_G 1
       #define C3_B 2
    #else
	    #ifdef COLOR_3_RBG
		   #define C3_R 0
		   #define C3_G 2
		   #define C3_B 1
	    #else
		   #ifdef COLOR_3_GBR
			   #define C3_R 2
			   #define C3_G 0
			   #define C3_B 1
		   #else
		   	   #ifdef COLOR_3_BGR
				   #define C3_R 2
				   #define C3_G 1
				   #define C3_B 0
			   #else
					#ifdef COLOR_3_BRG
					   #define C3_R 1
					   #define C3_G 2
					   #define C3_B 0
				   #else
					  #define C3_G 0
					  #define C3_R 1
					  #define C3_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_4_RGB
       #define C4_R 0
       #define C4_G 1
       #define C4_B 2
    #else
	    #ifdef COLOR_4_RBG
		   #define C4_R 0
		   #define C4_G 2
		   #define C4_B 1
	    #else
		   #ifdef COLOR_4_GBR
			   #define C4_R 2
			   #define C4_G 0
			   #define C4_B 1
		   #else
		   	   #ifdef COLOR_4_BGR
				   #define C4_R 2
				   #define C4_G 1
				   #define C4_B 0
			   #else
					#ifdef COLOR_4_BRG
					   #define C4_R 1
					   #define C4_G 2
					   #define C4_B 0
				   #else
					  #define C4_G 0
					  #define C4_R 1
					  #define C4_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_5_RGB
       #define C5_R 0
       #define C5_G 1
       #define C5_B 2
    #else
	    #ifdef COLOR_5_RBG
		   #define C5_R 0
		   #define C5_G 2
		   #define C5_B 1
	    #else
		   #ifdef COLOR_5_GBR
			   #define C5_R 2
			   #define C5_G 0
			   #define C5_B 1
		   #else
		   	   #ifdef COLOR_5_BGR
				   #define C5_R 2
				   #define C5_G 1
				   #define C5_B 0
			   #else
					#ifdef COLOR_5_BRG
					   #define C5_R 1
					   #define C5_G 2
					   #define C5_B 0
				   #else
					  #define C5_G 0
					  #define C5_R 1
					  #define C5_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_6_RGB
       #define C6_R 0
       #define C6_G 1
       #define C6_B 2
    #else
	    #ifdef COLOR_6_RBG
		   #define C6_R 0
		   #define C6_G 2
		   #define C6_B 1
	    #else
		   #ifdef COLOR_6_GBR
			   #define C6_R 2
			   #define C6_G 0
			   #define C6_B 1
		   #else
		   	   #ifdef COLOR_6_BGR
				   #define C6_R 2
				   #define C6_G 1
				   #define C6_B 0
			   #else
					#ifdef COLOR_6_BRG
					   #define C6_R 1
					   #define C6_G 2
					   #define C6_B 0
				   #else
					  #define C6_G 0
					  #define C6_R 1
					  #define C6_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_7_RGB
       #define C7_R 0
       #define C7_G 1
       #define C7_B 2
    #else
	    #ifdef COLOR_7_RBG
		   #define C7_R 0
		   #define C7_G 2
		   #define C7_B 1
	    #else
		   #ifdef COLOR_7_GBR
			   #define C7_R 2
			   #define C7_G 0
			   #define C7_B 1
		   #else
		   	   #ifdef COLOR_7_BGR
				   #define C7_R 2
				   #define C7_G 1
				   #define C7_B 0
			   #else
					#ifdef COLOR_7_BRG
					   #define C7_R 1
					   #define C7_G 2
					   #define C7_B 0
				   #else
					  #define C7_G 0
					  #define C7_R 1
					  #define C7_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_8_RGB
       #define C8_R 0
       #define C8_G 1
       #define C8_B 2
    #else
	    #ifdef COLOR_8_RBG
		   #define C8_R 0
		   #define C8_G 2
		   #define C8_B 1
	    #else
		   #ifdef COLOR_8_GBR
			   #define C8_R 2
			   #define C8_G 0
			   #define C8_B 1
		   #else
		   	   #ifdef COLOR_8_BGR
				   #define C8_R 2
				   #define C8_G 1
				   #define C8_B 0
			   #else
					#ifdef COLOR_8_BRG
					   #define C8_R 1
					   #define C8_G 2
					   #define C8_B 0
				   #else
					  #define C8_G 0
					  #define C8_R 1
					  #define C8_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_9_RGB
       #define C9_R 0
       #define C9_G 1
       #define C9_B 2
    #else
	    #ifdef COLOR_9_RBG
		   #define C9_R 0
		   #define C9_G 2
		   #define C9_B 1
	    #else
		   #ifdef COLOR_9_GBR
			   #define C9_R 2
			   #define C9_G 0
			   #define C9_B 1
		   #else
		   	   #ifdef COLOR_9_BGR
				   #define C9_R 2
				   #define C9_G 1
				   #define C9_B 0
			   #else
					#ifdef COLOR_9_BRG
					   #define C9_R 1
					   #define C9_G 2
					   #define C9_B 0
				   #else
					  #define C9_G 0
					  #define C9_R 1
					  #define C9_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_10_RGB
       #define C10_R 0
       #define C10_G 1
       #define C10_B 2
    #else
	    #ifdef COLOR_10_RBG
		   #define C10_R 0
		   #define C10_G 2
		   #define C10_B 1
	    #else
		   #ifdef COLOR_10_GBR
			   #define C10_R 2
			   #define C10_G 0
			   #define C10_B 1
		   #else
		   	   #ifdef COLOR_10_BGR
				   #define C10_R 2
				   #define C10_G 1
				   #define C10_B 0
			   #else
					#ifdef COLOR_10_BRG
					   #define C10_R 1
					   #define C10_G 2
					   #define C10_B 0
				   #else
					  #define C10_G 0
					  #define C10_R 1
					  #define C10_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_11_RGB
       #define C11_R 0
       #define C11_G 1
       #define C11_B 2
    #else
	    #ifdef COLOR_11_RBG
		   #define C11_R 0
		   #define C11_G 2
		   #define C11_B 1
	    #else
		   #ifdef COLOR_11_GBR
			   #define C11_R 2
			   #define C11_G 0
			   #define C11_B 1
		   #else
		   	   #ifdef COLOR_11_BGR
				   #define C11_R 2
				   #define C11_G 1
				   #define C11_B 0
			   #else
					#ifdef COLOR_11_BRG
					   #define C11_R 1
					   #define C11_G 2
					   #define C11_B 0
				   #else
					  #define C11_G 0
					  #define C11_R 1
					  #define C11_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_12_RGB
       #define C12_R 0
       #define C12_G 1
       #define C12_B 2
    #else
	    #ifdef COLOR_12_RBG
		   #define C12_R 0
		   #define C12_G 2
		   #define C12_B 1
	    #else
		   #ifdef COLOR_12_GBR
			   #define C12_R 2
			   #define C12_G 0
			   #define C12_B 1
		   #else
		   	   #ifdef COLOR_12_BGR
				   #define C12_R 2
				   #define C12_G 1
				   #define C12_B 0
			   #else
					#ifdef COLOR_12_BRG
					   #define C12_R 1
					   #define C12_G 2
					   #define C12_B 0
				   #else
					  #define C12_G 0
					  #define C12_R 1
					  #define C12_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_13_RGB
       #define C13_R 0
       #define C13_G 1
       #define C13_B 2
    #else
	    #ifdef COLOR_13_RBG
		   #define C13_R 0
		   #define C13_G 2
		   #define C13_B 1
	    #else
		   #ifdef COLOR_13_GBR
			   #define C13_R 2
			   #define C13_G 0
			   #define C13_B 1
		   #else
		   	   #ifdef COLOR_13_BGR
				   #define C13_R 2
				   #define C13_G 1
				   #define C13_B 0
			   #else
					#ifdef COLOR_13_BRG
					   #define C13_R 1
					   #define C13_G 2
					   #define C13_B 0
				   #else
					  #define C13_G 0
					  #define C13_R 1
					  #define C13_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_14_RGB
       #define C14_R 0
       #define C14_G 1
       #define C14_B 2
    #else
	    #ifdef COLOR_14_RBG
		   #define C14_R 0
		   #define C14_G 2
		   #define C14_B 1
	    #else
		   #ifdef COLOR_14_GBR
			   #define C14_R 2
			   #define C14_G 0
			   #define C14_B 1
		   #else
		   	   #ifdef COLOR_14_BGR
				   #define C14_R 2
				   #define C14_G 1
				   #define C14_B 0
			   #else
					#ifdef COLOR_14_BRG
					   #define C14_R 1
					   #define C14_G 2
					   #define C14_B 0
				   #else
					  #define C14_G 0
					  #define C14_R 1
					  #define C14_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
    #ifdef COLOR_15_RGB
       #define C15_R 0
       #define C15_G 1
       #define C15_B 2
    #else
	    #ifdef COLOR_15_RBG
		   #define C15_R 0
		   #define C15_G 2
		   #define C15_B 1
	    #else
		   #ifdef COLOR_15_GBR
			   #define C15_R 2
			   #define C15_G 0
			   #define C15_B 1
		   #else
		   	   #ifdef COLOR_15_BGR
				   #define C15_R 2
				   #define C15_G 1
				   #define C15_B 0
			   #else
					#ifdef COLOR_15_BRG
					   #define C15_R 1
					   #define C15_G 2
					   #define C15_B 0
				   #else
					  #define C15_G 0
					  #define C15_R 1
					  #define C15_B 2
				   #endif
			   #endif
		   #endif
		#endif
    #endif
#else
	 #ifdef STATIC_COLOR_RGB
		   #define C_R 0
		   #define C_G 1
		   #define C_B 2
		#else
			#ifdef STATIC_COLOR_RBG
			   #define C_R 0
			   #define C_G 2
			   #define C_B 1
			#else
			   #ifdef STATIC_COLOR_GBR
				   #define C_R 2
				   #define C_G 0
				   #define C_B 1
			   #else
				   #ifdef STATIC_COLOR_BGR
					   #define C_R 2
					   #define C_G 1
					   #define C_B 0
				   #else
						#ifdef STATIC_COLOR_BRG
						   #define C_R 1
						   #define C_G 2
						   #define C_B 0
					   #else
							#ifdef STATIC_COLOR_GRB
								  #define C_G 0
								  #define C_R 1
								  #define C_B 2
							#endif
					   #endif
				   #endif
			   #endif
			#endif
		#endif
#endif



// -- Array of all controllers
//static CLEDController * gControllers[FASTLED_I2S_MAX_CONTROLLERS];
static int gNumControllers = 0;
static int gNumStarted = 0;

