hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_84_3.h
// -- Global semaphore for the whole show process
//    Semaphore is not given until all data has been sent
static xSemaphoreHandle gTX_sem = NULL;

// -- One-time I2S initialization
static bool gInitialized = false;

// -- Interrupt handler
static intr_handle_t gI2S_intr_handle = NULL;

// -- A pointer to the memory-mapped structure: I2S0 or I2S1
static i2s_dev_t * i2s;

// -- I2S goes to these pins until we remap them using the GPIO matrix
static int i2s_base_pin_index;

// --- I2S DMA buffers
struct DMABuffer {
    lldesc_t descriptor;
    uint8_t * buffer;
};

#define NUM_DMA_BUFFERS 4
static DMABuffer * dmaBuffers[NUM_DMA_BUFFERS];

// -- Bit patterns
//    For now, we require all strips to be the same chipset, so these
//    are global variables.

static int      gPulsesPerBit = 0;
static uint32_t gOneBit[40] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
static uint32_t gZeroBit[40]  = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};

// -- Counters to track progress
static int gCurBuffer = 0;
static bool gDoneFilling = false;
static int ones_for_one;
static int ones_for_zero;

// -- Temp buffers for pixels and bits being formatted for DMA
static uint8_t gPixelRow[NUM_COLOR_CHANNELS][32];
static uint8_t gPixelBits[NUM_COLOR_CHANNELS][8][4];
static int CLOCK_DIVIDER_N;
static int CLOCK_DIVIDER_A;
static int CLOCK_DIVIDER_B;
static int dmaBufferActive;

	static volatile bool stopSignal;
 static volatile bool runningPixel=false;

	  //CRGB  pixelg[8][5]; //volatile uint8_t pixelg[8][5];
	   //uint8_t pixelg[16][8][4] ;
	//volatile uint8_t pixelr[8][5];
	//volatile uint8_t pixelb[8][5];
  static volatile  int ledToDisplay;
//CRGB *int_leds;
 static  int dmaBufferCount=2; //we use two buffers
   /* typedef union {
        uint8_t bytes[16];
        uint16_t shorts[8];
        uint32_t raw[2];
    } Lines;*/

	typedef union {
        uint8_t bytes[16];
        uint32_t shorts[8];
        uint32_t raw[2];
    } Lines;
  static volatile  int num_strips;
 static volatile  int nun_led_per_strip;
   // int *Pins;
  static  int brightness_b;
  static  int brightness_r;
  static  int brightness_g;

static uint8_t green_map[256];
static uint8_t blue_map[256];
static uint8_t red_map[256];
    static int ledType;
	 static volatile CRGB *int_leds;
	 static CRGB m_scale;
//static Lines firstPixel[3];
//template <int DATA_PIN, int T1, int T2, int T3, EOrder RGB_ORDER = RGB, int XTRA0 = 0, bool FLIP = false, int WAIT_TIME = 5>
//<Pins,CLOCK_PIN,LATCH_PIN, GRB>
template<int *Pins,int CLOCK_PIN,int LATCH_PIN, EOrder RGB_ORDER = GRB>
class ClocklessController : public CPixelLEDController<RGB_ORDER>
{

  //int *Pins;
   	const int deviceBaseIndex[2] = {I2S0O_DATA_OUT0_IDX, I2S1O_DATA_OUT0_IDX};
	const int deviceClockIndex[2] = {I2S0O_BCK_OUT_IDX, I2S1O_BCK_OUT_IDX};
	const int deviceWordSelectIndex[2] = {I2S0O_WS_OUT_IDX, I2S1O_WS_OUT_IDX};
	const periph_module_t deviceModule[2] = {PERIPH_I2S0_MODULE, PERIPH_I2S1_MODULE};
public:

    void init()
    {
       // brigthness=10;

     //Serial.printf("%d %d %d\n",CLOCK_PIN,LATCH_PIN,NUM_LED_PER_STRIP);


	  for (int i = 0; i < NBIS2SERIALPINS; i++)
		if (Pins[i] > -1)
		{
			PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[Pins[i]], PIN_FUNC_GPIO);
			gpio_set_direction((gpio_num_t)Pins[i], (gpio_mode_t)GPIO_MODE_DEF_OUTPUT);
     pinMode(Pins[i],OUTPUT);
			gpio_matrix_out(Pins[i], deviceBaseIndex[I2S_DEVICE] + i+8, false, false);
		}

		//latch pin
		PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[LATCH_PIN], PIN_FUNC_GPIO);
			gpio_set_direction((gpio_num_t)LATCH_PIN, (gpio_mode_t)GPIO_MODE_DEF_OUTPUT);
     pinMode(LATCH_PIN,OUTPUT);
			gpio_matrix_out(LATCH_PIN, deviceBaseIndex[I2S_DEVICE] + 23, false, false);
	//if (baseClock > -1)
	//clock pin
		gpio_matrix_out(CLOCK_PIN, deviceClockIndex[I2S_DEVICE], false, false);
        /*
        RGB=0012,
        RBG=0021,
        GRB=0102,
        GBR=0120,
        BRG=0201,
        BGR=0210
         */
#ifndef STATIC_COLOR_PER_PIN
    #ifndef STATIC_COLOR_GRB
        #ifndef STATIC_COLOR_RGB
		        #ifndef STATIC_COLOR_RBG
				        #ifndef STATIC_COLOR_GBR
						        #ifndef STATIC_COLOR_BRG
								        #ifndef STATIC_COLOR_BGR
											C_R=(byte)(RGB_ORDER/64);
											C_G=(byte)((RGB_ORDER-C_R*64)/8);
											C_B=(byte)(RGB_ORDER-C_R*64-C_G*8);
										#endif
								#endif
						#endif
				#endif
        #endif
    #endif
#endif
        
        //Serial.printf(" color %d %d %d\n",C_R,C_B,C_G);
        
       // gpio_matrix_out(26, deviceWordSelectIndex[I2S_DEVICE], false, false);
       i2sInit();

    }

    virtual uint16_t getMaxRefreshRate() const { return 800; }

protected:



    static DMABuffer * allocateDMABuffer(int bytes)
    {
        DMABuffer * b = (DMABuffer *)heap_caps_malloc(sizeof(DMABuffer), MALLOC_CAP_DMA);

        b->buffer = (uint8_t *)heap_caps_malloc(bytes, MALLOC_CAP_DMA);
        memset(b->buffer, 0, bytes);

        b->descriptor.length = bytes;
        b->descriptor.size = bytes;
        b->descriptor.owner = 1;
        b->descriptor.sosf = 1;
        b->descriptor.buf = b->buffer;
        b->descriptor.offset = 0;
        b->descriptor.empty = 0;
        b->descriptor.eof = 1;
        b->descriptor.qe.stqe_next = 0;

        return b;
    }

    static void i2sInit()
    {
        // -- Only need to do this once
       // if (gInitialized) return;

        // -- Construct the bit patterns for ones and zeros
     //   initBitPatterns();

        // -- Choose whether to use I2S device 0 or device 1
        //    Set up the various device-specific parameters
        int interruptSource;
        if (I2S_DEVICE == 0) {
            i2s = &I2S0;
            periph_module_enable(PERIPH_I2S0_MODULE);
            interruptSource = ETS_I2S0_INTR_SOURCE;
            i2s_base_pin_index = I2S0O_DATA_OUT0_IDX;
        } else {
            i2s = &I2S1;
            periph_module_enable(PERIPH_I2S1_MODULE);
            interruptSource = ETS_I2S1_INTR_SOURCE;
            i2s_base_pin_index = I2S1O_DATA_OUT0_IDX;
        }

        // -- Reset everything
        i2sReset();
        i2sReset_DMA();
        i2sReset_FIFO();

